import gc


class Disease:
    def __init__(self, symptoms=[], info="", name="", type=""):
        self.symptoms = symptoms
        self.info = info
        self.name = name
        self.type = type
        self.points = 0


secret_disease_1 = Disease(symptoms=["Кашель", "Головний біль", "Нудота", "Спазми живота"], name="Здав не свою ргр", type="Студік НУЛП",info=
'''
Text
''')


#custom_disease_ = Disease(symptoms=[], name="", type="", info=
#'''
#
#''')

custom_disease_1 = Disease(symptoms=["Погіршення пам’яті", "Складність організації думок", "Проблеми з орієнтацією",
                                     "Невпізнання людей", "Труднощі з мовленням", "Труднощі з читанням", "Галюцинації",
                                     "Марення", "Параноя", "Дратівливість", "Зміни настрою", "Підвищена тривога",
                                     "Збіднення словникового запасу"], name="Альцгеймер", type="Нервова система", info=
'''
Хвороба Альцгеймера - найбільш поширена форма набутого недоумства (деменції), що є проявом тривалого поточного нейродегенеративного процесу.
Захворювання отримало назву на честь німецького психіатра Алоїса Альцгеймера, який вперше його описав.

Захворювання також відоме як:
Сенільна деменція альцгеймерівського типу;
Хвороба Альцгеймера.

Існує кілька конкуруючих гіпотез, що пояснюють можливі причини розвитку Альцгеймера. До найбільш популярних відносять амілоїдну та тау-гіпотезу. Загальна риса обох гіпотез - накопичення патологічного білка (бета-амілоїду та тау-білка) у головному мозку.

У нормі у здоровому організмі постійно утворюється бета-амілоїд. Існує ряд спеціальних механізмів, завдяки яким надлишковий амілоїд руйнується. Внаслідок не до кінця з'ясованих причин цей механізм може порушитись. В результаті формуються амілоїдні бляшки.

Тау-білок необхідний стабілізації структур нервової клітини. У деяких випадках тау-білки починаються "злипатися", формуючи так звані нейрофібрилярні клубки. Амілоїдні бляшки та нейрофібрилярні клубки порушують синаптичну передачу між нейронами, викликаючи їхню загибель. Головний мозок атрофується, розвивається деменція.
''')

custom_disease_2 = Disease(symptoms=["Головний біль", "Слабкість", "Сонливість", "Часте сечовипускання",
                                     "Нудота", "Блювання", "Гостра реакція на гучні звуки", "Почервоніння ока",
                                     "Сльозотеча", "Закладеність носа", "Яскраві плями перед очима",
                                     "Порушення чутливості"], name="Мігрень", type="Нервова система", info=
'''
Мігрень – це головний біль високої інтенсивності в одній половині голови. Може супроводжуватися нудотою, блюванням, непереносимістю різких запахів, гучних звуків та яскравого світла.

Захворювання також відоме як:
Ретинальна мігрень;
Хронічна мігрень;
Офтальмоплегическая мигрень;
Геміплегічна мігрень.

Вважається, що мігрень виникає на тлі спадкової схильності. У пацієнтів, схильних до мігрені, відзначається підвищена чутливість волокон трійчастого нерва, висока збудливість кори мозку у поєднанні з низькою активністю антиноцептивної системи (системи мозку, що гальмує проведення больових імпульсів). Під час больового нападу відбувається активація нервових волокон, периваскулярні закінчення яких виділяють больові нейропептиди: кальцитонін-ген-зв'язуючий пепетид, нейрокінін А та субстанцію Р. Це супроводжується розширенням кровоносних судин, порушенням проникності судинної стінки та виділенням больових вазоактивних речовин.
''')

custom_disease_3 = Disease(symptoms=["Головний біль", "Сонливість", "Проблеми із концентрацією уваги", "Спрага",
                                     "Пітливість", "Нудота", "Тремор", "Тахікардія", "Біль у животі",
                                     "Розлад кишечника"], name="Похмільний синдром", type="Нервова система", info=
'''
Похмільний синдром - це стан, який виникає наступного дня після вживання алкоголю та характеризується різноманітною симптоматикою.

Захворювання також відоме як:
Алкогольне похмілля.

Слід розрізняти похмільний синдром у здорової людини і у хворого на алкоголізм.

У людей, які страждають на алкоголізм, похмільний синдром є абстинентним, тобто пов'язаний з нестачею етанолу в крові.

У здорових людей точний механізм виникнення похмільного синдрому невідомий. Похмільний синдром розвивається в той момент, коли вміст етанолу в крові дорівнює або наближається до нуля.

До основних причин відносять:

підвищення рівня ацетальдегіду - проміжного препарату розпаду етанолу, який токсичніший від самого етанолу в десятки разів; ацетальдегід під дією ферменту алкогольної дегідрогенази розщеплюється до оцтової кислоти, але коли людина вживає велику кількість алкоголю, фермент не встигає метаболізувати весь ацетальдегід, чому він накопичується в крові; слід зазначити, що темні алкогольні напої викликають сильніше похмілля, ніж безбарвні, за рахунок вмісту в них, крім етанолу, сивушних масел і таніну; цукор також посилює симптоми похмільного синдрому, тому солодкі коктейлі найчастіше викликають важче похмілля;
алкоголь сам собою призводить до утворення ферменту CYP2E1, який метаболізує етанол в токсичну субстанцію;
підвищення рівня цитокінів – пептидних інформаційних молекул, що секретуються з імунних клітин; аналогічний процес синтезу цитокінів відбувається при запаленні у відповідь використання інфекції в організм; підвищений рівень цитокінів також впливає формування спогадів, що, на думку сучасних дослідників, може пояснювати провали у пам'яті після вживання алкоголю.
Супутні причини посилюють прояви похмільного синдрому:

дегідратація - етанол блокує продукцію антидіуретичного гормону, що призводить до почастішання сечовипускання, збільшення діурезу, тобто обсягу сечі та втрати рідини організмом;
втрата електролітів, що виникає в результаті збільшеного діурезу, у тому числі втрата магнію, що призводить до надмірного збудження нервових волокон, спричиняючи нервове збудження, головний біль, зміну серцевого ритму, а також м'язову слабкість;
нестача глюкози через пригнічення глюконеогенезу в печінці - процесу, що заповнює запаси глюкози в організмі; гіпоглікемія призводить до втоми, слабкості, зниження концентрації;
розширення судин (призводить до головного болю).
''')

custom_disease_4 = Disease(symptoms=['Порушення чутливості', 'Слабкість', 'Порушення зору',
                                    'Тремор', 'Нетримання сечі', 'Нестримання калу',
                                     'Порушення настрою', 'Труднощі з мовленням', 'Епілептичні напади',
                                     'Погіршення слуху', 'Головний біль', 'Гарячка',
                                     'Часті поперхування їжею'], name="Розсіяний склероз", type="Нервова система", info=
'''
Розсіяний склероз - це нейродегенеративне захворювання головного та спинного мозку з розвитком аутоімунного запалення нервової тканини, яке проявляється безліччю неспецифічних симптомів.

Захворювання також відоме як:
Первинно-прогресуючий розсіяний склероз;
Вторинно-прогресуючий розсіяний склероз;
Високоактивний розсіяний склероз;
Агресивний розсіяний склероз.

Захворювання часто веде до інвалідизації хворого та значного зниження якості життя. У половини хворих розсіяний склероз призводить до порушення виконання трудових функцій через 10 років, втрати здатності до пересування через 15 років, втрати навичок самообслуговування через 20 років.
Причину розсіяного склерозу остаточно не з'ясована. Передбачається, що захворювання розвивається в результаті поєднання спадкової схильності та несприятливих факторів зовнішнього середовища, які запускають каскад аутоімунних реакцій, що призводять до пошкодження нервових клітин та формування множинних вогнищ склерозу.

Серед основних причин, здатних призвести до дебюту (першого прояву) розсіяного склерозу (за умови наявності відповідних патологічних генів), називають віруси, такі як вірус Епштейна - Барр , цитомегаловірус , віруси герпесу , ретровіруси, порушення обміну.
''')

custom_disease_5 = Disease(symptoms=[
                                     'Набряк', 'Почервоніння',
                                     'Крововилив',
                                     'Патологічна рухливість пальця',
                                     'Відкрита рана'],
                           name="Перелом великого пальця стопи", type="Травми", info=
'''
Перелом великого пальця стопи - це порушення цілісності кісток великого пальця стопи під впливом зовнішнього впливу чи внутрішнього патологічного процесу.
Зламати великий палець на нозі може будь-хто. Це можливо через різкий і сильний удар по пальцю або падіння на нього важкого предмета, спотикання, попадання великого пальця в нерівності на дорозі, ДТП, різкого згинання стопи в області великого пальця (особливо у спортсменів).
''')

custom_disease_6 = Disease(symptoms=['Біль у коліні', 'Набряк на коліні',
                                     'Почервоніння шкіри', 'Гематома',
                                     'Оніміння', 'Поколювання'], name="Удар коліна", type="Травми", info=
'''
Це закрите травматичне ушкодження м'яких тканин, що оточують колінний суглоб.
Забиті колінного суглоба - результат сильного впливу, зазвичай від удару або падіння, що ушкоджує м'які тканини і призводить до появи гематоми, набряку та запалення. При забитому місці відбувається розрив судин і кров потрапляє в суглобову порожнину і просочує м'язи, сухожилля. Залежно від інтенсивності удару крововилив може бути невеликим або досить рясним, призводячи до масивного заповнення суглобової порожнини кров'ю - гемартрозу.
''')

custom_disease_7 = Disease(symptoms=['Біль у лікті',
                                    'Гематома', 'Оніміння', 'Поколювання'], name="Удар ліктя", type="Травми", info=
'''
Удар ліктя - це закрите пошкодження м'яких тканин ліктя.

Лікоть утворений трьома кістками: ліктьовий, променевий та плечовий. До м'яких тканин ліктя відносяться нерви, зв'язки та м'язи.

''')

custom_disease_8 = Disease(symptoms=['Запаморочення', 'Погіршення слуху', 'Тиннітус',
                                     'Відчуття закладеності вуха'], name="Хвороба Меньєра", type="Хвороба вуха", info=
'''
Хвороба Меньєра - це захворювання, що вражає внутрішнє вухо. Патогенез хвороби вивчений недостатньо, припускають, що в основі лежить патологічне збільшення обсягу ендолімфи - рідини, що заповнює лабіринт; це призводить до розриву його оболонок, що проявляється симптоматикою порушення функції органів слуху та рівноваги.

Захворювання також відоме як:
Ендолімфатична водянка;
Синдром Меньера;
Запаморочення Меньєра.

Немає загальновизнаної теорії, що пояснює механізм виникнення хвороби Меньєра. Припускають, що захворювання генетично обумовлено, оскільки існує закономірність у розвитку у близьких родичів і вони виявляється специфічна мутація. Також серед передбачуваних факторів, що викликають це захворювання, називають аутоімунні процеси, порушення анатомії скроневої кістки, будови судин, обміну іонів в ендолімфі та перилимфе (рідина, що заповнює простір між кістковим та перетинчастим лабіринтом внутрішнього вуха).
''')

custom_disease_9 = Disease(symptoms=['Запаморочення', 'Порушення рівноваги',
                                     'Ністагм',
                                     'Погіршення слуху', 'Підвищена температура', 'Біль у вусі'], name="Лабіринтит", type="Хвороба вуха", info=
'''
Лабіринтит – це запальне захворювання внутрішнього вуха (лабіринту), найчастіше інфекційної природи. Лабіринт - це структура внутрішнього вуха, що відповідає за розпізнавання звукових коливань, передачу інформації про них у головний мозок, а також за підтримку рівноваги.

Захворювання також відоме як:
Вестибулярний неврит;
Вестибулярний нейроніт;
Нейролабіринтит.

Лабіринтит - завжди наслідок іншого запального процесу (через будову внутрішнього вуха). Джерело інфекції зазвичай розташовується в безпосередній близькості від лабіринту (середнє вухо та порожнина черепа). Збудник може бути бактеріальної чи вірусної природи. Найчастіша причина захворювання – запалення середнього вуха – середній отит.

Розвиток лабіринтиту також можливий після травми, черепно-мозкового або баротравми вуха.
''')

custom_disease_10 = Disease(symptoms=['Опухлість завушної діляки', 'Почервоніння завушної ділянки',
                                      'Біль у вусі', 'Погіршення слуху', 'Слабкість', 'Лихоманка',
                                      'Головний біль'], name="Мастоїдит", type="Хвороба вуха", info=
'''
Мастоїдит - це запальне захворювання комірчастої частини скроневої кістки (соскоподібного відростка), що часто протікає з частковим руйнуванням його структури.

Захворювання також відоме як:
Отоантрит.

Найчастіша причина – перехід патологічного процесу на соскоподібний відросток із середнього вуха при неправильно лікуваному гнійному середньому отиті. Інфекція із середнього вуха поширюється на структури скроневої кістки та вражає соскоподібний відросток, формуючи при неправильному чи несвоєчасному лікуванні його абсцес.

Часті бактерії-збудники мастоїдиту: пневмокок, бета-гемолітичні стрептококи групи, золотистий стафілокок, мораксели, гемофільна та синьогнійна палички.
''')

custom_disease_11 = Disease(symptoms=['Біль у вусі', 'Оторея', 'Сверблячка', 'Погіршення слуху',
                                      'Лімфоаденопатія',
                                      'Підвищена температура', 'Головний біль', 'Ломота в тілі'], name="Зовнішній отит", type="Хвороба вуха", info=
'''
Зовнішній отит - це запальне захворювання зовнішнього відділу вуха (вушна раковина та зовнішній слуховий прохід), яке супроводжується болем, свербінням, виділеннями із зовнішнього слухового проходу та іншими симптомами.

Захворювання також відоме як:
Запалення зовнішнього вуха;
Гострий зовнішній отит;
Хронічний зовнішній отит;
Дифузний зовнішній отит.

Причиною розвитку зовнішнього отиту є інфекція, що проникає через пошкоджені шкірні покриви, що призводить до розвитку місцевого запалення та набряку. Як інфекційні агенти виступає патогенна та умовно-патогенна бактеріальна мікрофлора, рідше збудником є грибкова інфекція. Серед бактеріальної флори зовнішній отит найчастіше викликають синьогнійна паличка, золотистий стафілокок, стрептококи, мікоплазма та деякі інші. Грибковий зовнішній отит викликають гриби роду Candida, аспергіли, найчастіше він виявляється в осіб із імунодефіцитними станами.

Пошкодження шкіри настає внаслідок механічного травмування, найчастіше внаслідок чищення вух ватними паличками, сірниками та іншими пристосуваннями, а також внаслідок розчісування, наприклад, при алергічних захворюваннях.

Зовнішні умови середовища (висока температура навколишнього середовища, підвищена вологість, тривале перебування у воді) створюють сприятливе середовище для розмноження патогенної флори і можуть призводити до виникнення зовнішнього отиту.

Зовнішній отит може розвиватися і натомість захворювань, які впливають стан шкіри (дерматити, цукровий діабет, ВІЛ-інфекція та інші).
''')

custom_disease_12 = Disease(symptoms=['Головний біль', 'Слабкість', 'Порушення зору',
                                      'Набряк повік', 'Кон’юнктиви очей', 'Почервоніння повік',
                                      'Свербіння', 'Сльозотеча', 'Порушення зору'], name="Алергічний кон'юнктивіт", type="Хвороба очей", info=
'''
Алергічний кон'юнктивіт - це запалення кон'юнктиви (тонкої прозорої оболонки, що покриває зовні очей і задню поверхню повік), спричинене алергією. Захворювання може проявлятися цілий рік або сезонним. Сезонна форма виникає при сенсибілізації (підвищеної чутливості) до пилкових (поліноз) і грибкових алергенів, а цілорічна - до алергенів кліщів домашнього пилу, бібліотечного пилу, епідермальних алергенів тварин і птахів, алергенів комах, алергенів цвілевих їх прийомі, професійним алергенам.

Завхворювання також відоме, як: 
Полінозний кон'юнктивіт;
Сінна лихоманка;
сезонний кон'юнктивіт.

Контакт с определенным аллергеном (веществом, которое при взаимодействии с иммунной системой человека запускает аллергическую реакцию).
''')

custom_disease_13 = Disease(symptoms=['Виділення з носа', 'Закладеність носа', 'Кашель', 'Головний біль',
                                      'Підвищена температура', 'Головний біль', 'Ломота в тілі',
                                      'Погіршення нюху', 'Свербіж у носі'], name="Синусит", type="Хвороба носоглотки", info=
'''
Синусит - це запальне захворювання приносових пазух, яке проявляється закладеністю носа, головним або зубним болем, зниженням нюху, гноєтечіем, підвищенням температури тіла, кашлем та іншими катаральними явищами. Синусит може бути викликаний попаданням інфекції до придаткових пазух, а також дією зовнішніх факторів навколишнього середовища. При збереженні симптомів синуситу до 12 тижнів говорять про гострий синусит, більше 12 тижнів - хронічний. Хронічний синусит може набувати циклічного варіанта течії з періодами загострень і поліпшень, у такому разі він називається рецидивуючим. Дуже важливо вчасно виявити захворювання, тому що зволікання в лікуванні може призводити до неконтрольованого перебігу та важких ускладнень.
В основі синуситу лежить виникнення запального процесу стінки приносових пазух з розвитком місцевого набряку, гіперемії та підвищеної секреції рідини. Набряк слизової оболонки призводить до порушення відтоку секрету та утворення застою, який є сприятливим середовищем для розвитку патогенної флори. Синусит розвивається внаслідок дії інфекційного агента або під дією зовнішніх факторів середовища. До таких причин належать:

Захворювання також відоме як
Гострий синусит;
хронічний синусит;
Гайморит;
Етмоїдит;
Фронтит;
Сфеноїдит;
Пансинусит.

віруси (аденовіруси, риновіруси, ентеровіруси, вірус парагрипу та ін.);
бактерії (золотистий стафілокок, пневмококи, гемофільна паличка, коринобактерії);
гриби (дріжджоподібні гриби роду Candida, плісняві гриби - аспергіли, фузаріум, пеніцили тощо);
алергени (пилок рослин, пил на шкідливих виробництвах);
сторонні тіла у пазухах (після проведення стоматологічних чи хірургічних маніпуляцій);
травми лицьового скелета.
У разі розвитку запалення у верхньощелепній пазусі синусит називається гайморитом, при запаленні лобових пазух – фронтитом, решітчастого лабіринту – етмоїдитом, клиноподібної пазухи – сфеноїдитом. Якщо запальний процес торкається всіх придаткових пазух, тоді говорять про розвиток пансинуситу.
''')

custom_disease_14 = Disease(symptoms=['Біль у горлі', 'Збільшення лімфатичних вузлів',
                                      'Кашель', 'Підвищена температура', 'Головний біль', 'Ломота в тілі'], name="Тонзиліт", type="Хвороба носоглотки", info=
'''
Тонзиліт - це запалення слизової оболонки піднебінних мигдаликів, яке проявляється болем у горлі , запаленням , набряком , підвищенням температури тіла та іншими симптомами.

Поділяється на гострий та хронічний. Гострий тонзиліт виникає в результаті впливу інфекційного агента на мигдалики (частіше віруси, рідше бактеріальна або грибкова інфекція), а також є основним симптомом низки інфекційних захворювань (дифтерія, інфекційний мононуклеоз, черевний тиф та ін.).

Хронічний тонзиліт є ускладненням гострого запального процесу або розвивається і натомість хронічного вогнища інфекції.

Нерідко тонзиліти поєднуються з іншими запальними захворюваннями верхніх дихальних шляхів ( риніт , ларингіт , бронхіт ). Тривалий хронічний тонзиліт без відповідного лікування може призводити до розвитку ускладнень серцево-судинної системи, нирок та інших органів.

Захворювання також відоме як:
Ангіна;
Хронічний тонзиліт;
Гострий тонзиліт.

Інфекція впроваджується в слизову оболонку піднебінних мигдаликів, що викликає місцевий набряк та запалення. Структура мигдаликів з великою кількістю лакун та поглиблень ускладнює відтік та створює сприятливі умови для розвитку інфекції.

Тонзиліт можуть викликати такі інфекційні агенти:

віруси ( аденовірус , віруси грипу та парагрипу , вірус Епштейна - Барр );
бактерії (бета-гемолітичний стрептокок групи А, золотистий стафілокок , гемолітичний стафілокок, пневмокок, мікоплазма );
гриби (у більшості випадків роду Candida );
Corynebacterium diphtheriae (збудник дифтерії );
Neisseria gonorrhoeae (збудник гонореї ).
Велику роль розвитку хронічного тонзиліту грає умовно-патогенна мікрофлора, яка може викликати запалення при зниженні загального та місцевого імунітету.
''')

custom_disease_15 = Disease(symptoms=['Нежить', 'Головний біль', 'Кашель', 'Біль у горлі', 'Гарячка',
                                      'Діарея', 'Важке дихання', 'Біль у грудній клітці'], name="Коронавірусна інфекція", type="Інфекції", info=
'''
Коронавірусна інфекція - це інфекційний процес, викликаний коронавірусами. Коронавіруси - це велика родина вірусів, які викликають хвороби, починаючи від застуди і закінчуючи тяжкими захворюваннями. Більшість людей хоч раз переносили коронавірусну інфекцію у якийсь момент їхнього життя.

Коронавіруси названі через короноподібні шипи на поверхні вірусу. Деякі коронавіруси передаються між тваринами, деякі між тваринами та людьми, інші — від людей до людей.

Зазвичай коронавіруси викликають легкі або помірні інфекції верхніх дихальних шляхів, що протікають як застуда. У дітей зараження найчастіше протікає у вигляді шлунково-кишкової інфекції. Коронавіруси можуть викликати і більш серйозні захворювання, такі як бронхіт та пневмонія.

Існує сім типів коронавірусів, які викликають хворобу у людини, включаючи уханьський коронавірус 2019 -nCoV, коронавірус близькосхідного респіраторного синдрому (MERS) та коронавіруси важкого гострого респіраторного синдрому (ТОРС).

Людські коронавіруси зазвичай передаються від зараженої людини іншим людям через:

повітря при кашлі та чханні;
тісний особистий контакт, наприклад, дотик або рукостискання;
дотик до об'єкта чи поверхні з вірусом, потім торкання рота, носа чи очей;
рідко через фекалії.
Найчастіше епідемії коронавірусної інфекції викликані коронавірусом, який спочатку був зоонозним, але потім від тварини передався людині. Причиною поширення інфекцій в даний час стає перенаселення міст, збільшення споживання м'яса, розширення житлових зон в області проживання диких тварин і доступний транспорт, що дозволяє пересуватися хворим через країни та континенти.
''')

custom_disease_16 = Disease(symptoms=['Підвищена температура', 'Слабкість', 'Біль у горлі', 'Головний біль',
                                      'Блідість шкірних покривів', 'Набряк м’яких тканин шиї', 'Біль у животі',
                                      'Блювання', 'Важке дихання'], name="Дифтерія", type="Інфекції", info=
'''
Дифтерія - це інфекційне захворювання гортані та верхніх дихальних шляхів, викликане бактерією Corynebacterium diphtheriae (бацила Леффлера, дифтерійна паличка), характерні особливості якого утворення характерних "дифтерійних" плівок на поверхні слизових оболонок, що утруднюють дихання.

Причина виникнення захворювання - інфікування коринебактерією дифтерії (Corynebacterium diphtheriae), яка також відома як паличка Леффлера. Зараження найчастіше походить від хворої людини повітряно-краплинним шляхом, рідше – контактним через предмети побуту або з продуктами харчування. Після попадання на слизову оболонку верхніх дихальних шляхів мигдалин бактерії виділяють токсин. Дифтерійний токсин руйнує тканини, що підлягають. Формуються дифтерійні плівки - щільні, спаяні зі слизовою оболонкою нальоти на слизовій оболонці. При знятті відзначається невелика кровоточивість. Через пошкодження в слизовій оболонці токсин потрапляє в кровотік, розноситься у всі органи, порушуючи їхню функцію.
''')

custom_disease_17 = Disease(symptoms=['Токсикоз', 'Слабкість', 'Ломота в суглобах', 'Головний біль', 'Закладеність носа', 'Біль у горлі', 'Сльозотеча', 'Біль у м’язах', 'Блювота', 'Понос'], name="Грип", type="Інфекції", info=
'''
Грип - це гостра вірусна інфекція з повітряно-краплинним шляхом передачі збудника, що характеризується гострим початком, лихоманкою, загальною інтоксикацією та ураженням дихальних шляхів.

Захворювання також відоме як:
Сезонний грип;
гостра респіраторна вірусна інфекція (ГРВІ);
гостре респіраторне захворювання (ГРЗ).

Збудник грипу - РНК-вірус сімейства Orthomyxoviridae, роду Influenzavirus. Описано три типи вірусу: А, В та С. Віруси грипу А широко поширені в природі, вражають людей, тварин та птахів. Унікальна особливість вірусу А – постійна мінливість та поява нових типів вірусу, наслідком чого є щорічні спалахи та епідемії грипу. Віруси грипу типу В та С виділяються тільки від людей. Вірус грипу передається повітряно-крапельним, повітряно-пиловим та контактним шляхами.
''')

custom_disease_18 = Disease(symptoms=['Діарея', 'Біль у животі', 'Нудота блювота', 'Здуття живота', 'Вирування в кишечнику', 'Підвищення температури', 'Слабкість', 'Відсутність апетиту'], name="Кишкова інфекція", type="Інфекції", info=
'''
Кишкова інфекція - це група захворювань з переважним ураженням шлунково-кишкового тракту та подібними симптомами, причиною яких є бактерії, віруси, гриби та паразити.

Захворювання також відоме як:
Часто зустрічаються терміни "гостра кишкова інфекція" або "харчова токсикоінфекція". Їх застосовують, коли встановлено збудник інфекції. Якщо збудник визначено, то використовують такі назви:

черевний тиф;
дизентерія;
холера;
ешеріхіози;
сальмонельоз;
кишковий ієрсініоз;
ротавірусна інфекція;
псевдомембранозний коліт;
ботулізм та інші.
По відділу ураження шлунково-кишкового тракту розрізняють:

гастрит - ураження з переважною локалізацією у шлунку;
ентерит - ураження тонкої кишки;
коліт - ураження товстої кишки;
гастроентерит - поєднання гастриту з ентеритом;
ентероколіт - одночасне ураження тонкої та товстої кишок;
гастроентероколіт - ураження всіх відділів травного тракту.


Збудниками кишкових інфекцій можуть бути різні мікроорганізми:
бактерії - шигели, сальмонели, кишкові палички та інші;
віруси - ротавірус, вірус Норволк, аденовірус, ентеровірус;
паразити (найпростіші та гельмінти) - амеби, лямблії;
гриби - гриби роду Candida.
''')

custom_disease_19 = Disease(symptoms=['Головний біль', 'Слабкість', 'Підвищення температури', 'Втрата апетиту', 'Нежить', 'Сухий кашель', 'Почервоніння горла', 'Набряк горла', 'Збільшення лімфовузлів', 'Запалення слизової оболонки очей', 'Висип по тілу'], name="Кір", type="Інфекції", info=
'''
Кір – це гостре інфекційне захворювання вірусної етіології, що зустрічається головним чином у дітей і характеризується підвищенням температури, катаральним запаленням слизових оболонок носа, очей та горла та появою на шкірі плямистого висипу з переходом у пігментацію. Це одна з найбільш заразних хвороб, відомих на сьогоднішній день (сприйнятливість досягає 100%).

Захворювання також відоме як:
реактивний кір;
мітигований (ослаблений) кір;
кір у вакцинованих дітей;
плями Бєльського - Філатова - Копліка.

Збудник кору - РНК-вірус з роду Morbillivirus, сімейства Paramyxoviridae. В організм здорової людини вірус проникає повітряно-краплинним шляхом через виділення зі слизової оболонки носа, рота чи горла зараженої людини. Зараження можливе як при тісному спілкуванні, так і на певній відстані під час занесення інфікованого повітря в сусідні приміщення. Поширення інфекції сприяє кашель, чхання.
Пацієнт заразний починаючи з 7-го дня від контакту і до 5-го дня від розвитку висипу. Через третіх осіб вірус не передається.
Можливий трансплацентарний шлях передачі із внутрішньоутробним зараженням при захворюванні жінки у третьому триместрі вагітності.
''')


custom_disease_ = Disease(symptoms=[], name="Краснуха", type="Інфекції", info=
'''
Краснуха — это острое вирусное инфекционное заболевание, протекающее с мелкопятнистыми высыпаниями, невысокой и кратковременной лихорадкой, увеличением заднешейных лимфатических узлов и способное привести к поражению плода у беременных.

Захворювання також відоме як:
корова краснуха;
триденний кір;
німецький кір;
післяродова краснуха;
синдром уродженої краснухи.

Краснуху викликає вірус краснухи, який належить до сімейства Togaviridae та є єдиним представником роду Rubivirus. Вірус краснухи передається повітряно-краплинним шляхом при чханні або кашлі інфікованої людини, а також через плаценту з розвитком важких вад плода (вроджена краснуха).

Сприйнятливість до краснухи загальна, найвища віком від 3 до 4 років. На краснуху хворіє лише людина.

Одноразового контакту з хворим недостатньо для захворювання, до зараження призводить тривалий і тісний контакт. Інфекція через предмети третіх осіб не передається внаслідок малої стійкості вірусу у зовнішньому середовищі. Хвора людина заразна протягом останніх 7 днів інкубаційного періоду і до 21 дня після появи висипань, а також заразні новонароджені діти з вродженою краснухою, у яких вірус може виділятися до 2-2,5 років.

У 30-50% інфікованих краснуха протікає у безсимптомній формі. Імунітет після краснухи, як правило, довічний, однак є повідомлення про повторне інфікування.
''')
















custom_disease_20 = Disease(symptoms=['Напруга в очах', 'Головний біль', 'Світлочутливість', 'Почервоніння очей',
                                    'Сльозотеча', 'Часте моргання'], name="Гіперметропія", type="Хвороба очей", info=
'''
Гіперметропія - медичний термін для позначення далекозорості. При цій патології промінь світла фокусується не так на сітківці, а й за нею, у результаті погіршується видимість предметів близькому відстані.

Захворювання також відоме як:
Далекозорість.

Для формування зображення промінь світла повинен пройти через оптичні середовища і сфокусуватися на сітківці. Основні органи ока, які заломлюють світло, - рогівка та кришталик. Їхня опукла форма дозволяє правильно розсіювати світлові промені, щоб вони фокусувалися рівно на сітківці.

При гіперметропії рогівка більш плоска або осьова довжина очного яблука дуже коротка, тому зображення не фокусуються, коли вони досягають сітківки, а промінь світла проходить за сітківку. Для ясного зору гіперметропічне око має пристосовуватися, щоб збільшити свою фокусувальну здатність. Це вимагає скорочення війного м'яза, і тому далекозоре око ніколи не відпочиває і працює ще інтенсивніше, щоб краще бачити близькі об'єкти.

Розрізняють вроджену гіперметропію, яка пов'язана з генетично обумовленим коротким очним яблуком або сплощеною рогівкою. Такий вид гіперметропії виявлятиметься ще з дитинства.

Слід пам'ятати, що до 10 років дитяче око росте, тому для дітей загалом характерна далекозорість. Але якщо гіперметропія зберігається після 10-річного віку, то найімовірніше це спадкова патологія.

З віком також погіршується зір поблизу, проте це пов'язано з природними віковими змінами. Кришталик стає менш еластичним, вії м'язи, які змінюють кривизну кришталика, слабшають. Всі ці процеси призводять до неправильного фокусування зображення.

Травми, важкі запальні процеси можуть призводити до зміни форми рогівки, робити її тоншою, що також призводитиме до гіперметропії.
''')

custom_disease_21 = Disease(symptoms=['Сверблячка в очах', 'Сльозотеча', 'Виділення з очей',
                                    'Опухлі повіки', 'Блефароспазм', 'Почервоніння очей',
                                    'Підвищена чутливість до світла', 'Пухирцеві висипання на шкірі обличчя'], name="Інфекційний кон'юнктивіт", type="Хвороба очей", info=
'''
Інфекційний кон'юнктивіт - це запалення кон'юнктиви (слизової оболонки, яка покриває око зовні та задню поверхню повік), викликане проникненням різних інфекційних агентів: бактерій, вірусів, грибів, найпростіших.
Віруси. Найчастіша причина кон'юнктивіту. Найчастіше до вірусного кон'юнктивіту наводить аденовірусна інфекція.
Бактерії. Особливу небезпеку становить хламідійна інфекція. Вона призводить до хронічного захворювання – трахоми, яка може спричинити сліпоту. Окремо виділяють бактеріальний кон'юнктивіт новонароджених, причина якого бактерії роду хламідії та гонококи, що викликають гонорею. Зараження відбувається під час проходження дитиною родових шляхів матері.
Гриби. Рідкісна причина інфекційного кон'юнктивіту, переважно можлива у хворих з імунодефіцитом.
''')

custom_disease_22 = Disease(symptoms=['Відчуття стороннього тіла', 'Печіння', 'Біль у оці', 'Сльозотеча',
                                      'Світлочутливість', 'Активне миготіння', 'Погіршення зору', 'Почервоніння ока',
                                      'Блефароспазм', 'Виділення з ока'], name="Стороннє тіло ока", type="Хвороба очей", info=
'''
Стороннє тіло ока - це патологічний стан, при якому сторонній предмет потрапляє на різну глибину в різні відділи очного яблука, очниці або допоміжного апарату ока (століття, кон'юнктива, слізні органи).

За ступенем проникнення розрізняють:
Поверхневі - стороннє тіло знаходиться на рогівці або склері;
Глибокі – проникає всередину структур ока аж до сітківки.

Найбільш поширені типи сторонніх предметів у оці:
Вії;
Слиз;
Тирса;
Бруд;
Пісок;
Косметика;
Контактні лінзи;
Металеві частки;
Скляні уламки.
''')

custom_disease_23 = Disease(symptoms=['Затуманений зір',
                                      'Погіршення зору', 'Поганий нічний зір',
                                      'Втрата чутливості'], name="Катаракта", type="Хвороба очей", info=
'''
Це захворювання, у якому виникає помутніння кришталика.
Кришталик ока є двоопуклою лінзою, що заломлює світло. Його помутніння відбувається з віком, під дією травм або таких захворювань, як цукровий діабет, галактоземія, хвороба Вільсона.
Найпоширеніший вид катаракти - вікова.
Зараз відомі біохімічні механізми, що призводять до помутніння кришталика, але контролювати їх поки що не навчилися.
''')

custom_disease_24 = Disease(symptoms=['Почервоніння очей', 'Біль у оці', 'Сльозотеча',
                                      'Блефароспазм', 'Затуманений зір',
                                      'Погіршення гостроти зору', 'Світлочутливість', 'Відчуття піску в оці',
                                      'Виділення із ока'], name="Кератит", type="Хвороба очей", info=
'''
Кератит – це запалення рогової оболонки ока чи рогівки.
Рогівка є передньою, найопуклішою частиною капсули ока, що складається з тонкої безсудинної мембрани, через яку світло, що заломлюється, потрапляє в задні відділи ока і формується зображення.

Виділяють такі причини кератиту:

Травми. Якщо будь-який сторонній предмет пошкодить поверхню рогівки, це може призвести до неінфекційного кератиту. Крім того, травма рогової оболонки дозволить мікроорганізмам спричинити інфекційний кератит.
Забруднені контактні лінзи. Бактерії, грибки або паразити можуть мешкати на поверхні контактної лінзи або контейнера для зберігання. Носіння контактних лінз довше за встановлений термін, недотримання правил гігієни призводить до інфікування лінз.
Вірусна інфекція. Найчастіша причина інфекційних кератитів. Здебільшого кератит викликають віруси герпесу.
Бактеріальна інфекція.
Гриби. Грибковий кератит складно діагностувати, і у нього частіше за інших кератитів рецидивуючий перебіг.
Забруднена вода. Мікроорганізми, що мешкають у воді, особливо в океанах, річках, озерах та басейнах, можуть потрапити в очі під час купання та призвести до кератиту. Проте запалення, найімовірніше, виникне і натомість попереднього пошкодження рогівки, наприклад, у результаті носіння контактних лінз.
Алергія.
''')

custom_disease_25 = Disease(symptoms=['Головний біль', 'Напруга очей'], name="Міопія", type="Хвороба очей", info=
'''
Міопія, або короткозорість, це розлад зору, коли світло фокусується перед сітківкою, а не на ній. Це призводить до того, що віддалені об'єкти стають розмитими, тоді як близькі об'єкти добре видно.

Оптична система ока представлена:
Водянистою вологою - желеподібна рідина, що заповнює передню та задню камери ока;
рогівкою, або роговою оболонкою, - прозора купоподібна передня частина очного яблука;
кришталик - двоопукла лінза, розташована всередині очного яблука;
склоподібне тіло - гелеподібна речовина, що заповнює простір між кришталиком і сітківкою.
Рогівка і кришталик заломлюють все вхідне світло, яке потім фокусується на сітківці, - задній частині очного яблука, яка по суті є частиною мозку і відповідає за формування зображення.
Якщо рогівка або кришталик вигнуті нерівномірно, то промені світла заломлюються неправильно і зникає чіткість зображення.

Міопія зазвичай виникає у таких випадках:
Очне яблуко довше, ніж зазвичай, і світлові промені не досягають сітківки;
занадто сильне заломлення світлових променів через порушення кривизни рогівки або кришталика, через що світло фокусується перед сітківкою, що призводить до розмитості віддалених об'єктів.
Існує помилкова міопія, яка називається астенопією, або синдром втомлених очей. Вона виникає внаслідок перенапруги війного м'яза ока при перевтомі, недосипанні, тривалому сидінні за комп'ютером. Тоді відбувається спазм м'яза та знижується гострота зору. Цей стан можна виправити, якщо вчасно усунути спазм, і гострота зору повернеться.
''')

custom_disease_26 = Disease(symptoms=['Головний біль', 'Швидка стомлюваність', 'Світлочутливість', 'Проблеми з світлосприйняттям',], name="Пресбіопія", type="Хвороба очей", info=
'''
Пресбіопія - це природний віковий процес, у якому втрачається здатність бачити предмети поблизу. Її також називають віковою далекозорістю.
Для формування зображення промінь світла повинен пройти через оптичні середовища і сфокусуватися на сітківці. Основні органи ока, які заломлюють світло: рогівка та кришталик.

Кришталик є двоопуклою лінзою, до якої прикріплені м'язи. Для фокусування зображення кришталик змінює форму завдяки роботі м'язового апарату. З віком кришталик стає товстішим, знижується його еластичність, а м'язи починають слабшати.

Все це призводить до нездатності фокусуватись на близьких предметах.

Пресбіопія є природним віковим процесом, проте існують фактори ризику, які можуть прискорити розвиток цього стану.
''')



custom_disease_27 = Disease(symptoms=['Запаморочення', 'Головний біль', 'Прискорене дихання', 'Закладеність', 'Шум у вухах', 'Холодні руки', 'Посилена спрага'], name="Анемія", type="Серцево-судинна система та кров", info=
'''
Анемія — це хворобливий стан, у якому кров людини з різних причин містить дуже мало гемоглобіну чи еритроцитів (червоних кров'яних клітин). Нижня межа нормального рівня гемоглобіну у чоловіків становить 130 г/л, у жінок – 120 г/л. Занадто мала кількість гемоглобіну не може забезпечити насичення організму киснем, через що порушується робота всіх органів та з'являються неприємні симптоми. Тяжка анемія може призвести до дуже серйозних наслідків до загибелі хворого.

Захворювання також відоме як:
Застаріла російська назва анемії - недокрів'я. Залежно від причини, через яку знижується гемоглобін, анемія може бути залізодефіцитна, гіпер- та гіпохромна, мікро- та макроцитарна тощо. На англійській хворобі називається анемія.

На рівень гемоглобіну в крові можуть вплинути сотні найрізноманітніших факторів, від неякісного харчування до спадковості. Усього лікарі налічують понад 400 причин виникнення анемії, які можна об'єднати у три основні групи:
втрата крові (геморагічна анемія);
недостатнє утворення еритроцитів або гемоглобіну;
надмірне руйнування еритроцитів (гемолітична анемія).
''')

custom_disease_28 = Disease(symptoms=['Головний біль', 'Дзвін у вухах', 'Запаморочення', 'Носові кровотечі'], name="Артеріальна гіпертензія", type="Серцево-судинна система та кров", info=
'''
Артериальная гипертензия — это стабильное повышение артериального давления (АД) от 140/90 мм рт. ст. и выше. Большое количество заболеваний способны приводить к постоянному повышению артериального давления, в случае если такое заболевание удается установить, артериальную гипертензию называют вторичной, если же какую-то одну причину выявить не удается, артериальная гипертензия называется эссенциальной, или первичной.

Длительное повышение давления до высоких цифр очень негативно сказывается на организме. В первую очередь страдают так называемые органы-мишени, к которым относятся сердце, почки, головной мозг и сетчатка глаз. Их работа ухудшается, что может привести к таким опасным исходам, как инсульт и инфаркт. Вот почему следить за своим давлением и держать его в пределах нормы очень важно.

Захворювання також відоме як:
підвищений тиск;
гіпертонія;
гіпертонічна хвороба;
ГБ;
АГ.
''')

custom_disease_29 = Disease(symptoms=['Біль за грудиною', 'Пітливість', 'Стиснення в грудях', 'Прискорене серце биття', 'Нерегулярне серцебиття', 'Утруднене дихання', 'Страх', 'Запаморочення', 'Нудота блювота'], name="Ішемічна хвороба серця", type="Серцево-судинна система та кров", info=
'''
Ішемічна хвороба серця (ІХС) - це ураження міокарда, обумовлене минущим або необоротним порушенням кровотоку в коронарних артеріях.

Захворювання також відоме як:
ішемія;
коронарна хвороба серця.

У 95% випадків ішемічна хвороба серця обумовлена атеросклерозом коронарної артерії або активним стенозом епікардіальних судин.
До поодиноких причин можна віднести:
коронарні васкуліти при системних захворюваннях;
хвороба Кавасакі;
передозування судинозвужувальними препаратами або поряд наркотичних засобів;
уроджені аномалії відходження коронарної артерії.
''')


custom_disease_30 = Disease(symptoms=['Втома', 'Слабкість ', 'Запаморочення', 'Нудота', 'Втрата апетиту', 'Запор', 'Прискорене серцебиття', 'Біль у грудній клітці', 'Ціаноз', 'Часте сечовипускання', 'Набір ваги'], name="Хронічна серцева недостатність", type="Серцево-судинна система та кров", info=
'''
Хроническая сердечная недостаточность — это хроническое состояние, при котором нарушается насосная функция сердца, ухудшается кровоснабжение всех органов и организм не получает достаточное количество кислорода.

Серцева недостатність буває гострою та хронічною. Гостра виникає в результаті раптово розвиненого ураження серця, наприклад при інфаркті. Хронічна виникає внаслідок поступової декомпенсації (вичерпання можливостей компенсувати навантаження) функції серця внаслідок низки захворювань.

При хронічній серцевій недостатності (ХСП) порушується кровообіг, знижується швидкість кровотоку, що призводить до збільшення тиску в камерах серця. Поступово камери серця починають розтягуватися, потовщуються стінки серцевого м'яза, щоб утримувати більшу кількість крові або підвищений тиск. Зрештою м'язи серця слабшають і перестають качати кров із необхідною ефективністю, знижується надходження крові та кисню до органів. Намагаючись компенсувати погіршений кровообіг, включається механізм утримання рідини в організмі. В результаті виникають набряки, а навантаження на серце ще більше збільшується, що призводить до посилення серцевої недостатності.

Є різні типи хронічної серцевої недостатності:
систолічна серцева недостатність (ХСН зі зниженою фракцією викиду) виникає, коли серце надто слабке та не скорочується нормально;
діастолічна серцева недостатність (ХСН із збереженою фракцією викиду) – при даному типі ХСН камери серця стають надто товстими та жорсткими та не наповнюються кров'ю в повному обсязі;
поєднання двох типів.
Кожен тип хронічної серцевої недостатності може вражати лівий шлуночок, правий шлуночок або одночасно.

Захворювання, що призводять до хронічної серцевої недостатності:
ішемічна хвороба серця - захворювання, при якому артерії, що забезпечують серце кров'ю та киснем, звужуються внаслідок атеросклерозу, внаслідок чого серце відчуває нестачу кисню та поживних речовин;
інфаркт міокарда - пошкодження серцевого м'яза внаслідок різкого порушення її кровопостачання, що призводить до утворення рубця та хронічних порушень роботи серця;
кардіоміопатія - ушкодження серця інфекціями, алкоголем або наркотиками;
вроджені чи набуті вади клапанів серця;
високий артеріальний тиск;
певні види аритмій серця;
емфізема та інші хронічні захворювання легень;
цукровий діабет;
захворювання щитовидної залози;
ураження серця внаслідок хіміотерапії;
захворювання нирок;
тяжкі анемії.
''')

custom_disease_31 = Disease(symptoms=['Слабкість', 'Біль у серці', 'Прискорене серцебиття', 'Задишка', 'Підвищена температура', 'Набряки ніг', 'Асцит', 'Синюшність пальців рук'], name="Міокардит", type="Серцево-судинна система та кров", info=
'''
Міокардит - це захворювання серця, при якому запалення вражає саму серцевий м'яз - міокард. Хвороба багатолика, може протікати приховано та непомітно, іноді викликати тяжку серцеву недостатність. Причин міокардиту безліч: віруси, бактерії, грибки, паразити; токсини та отрути, ліки або власна імунна система людини можуть викликати запалення. Хвороба може протікати як гостро, із швидким погіршенням симптомів, так і тривало, до кількох місяців.

Міокардит відрізняється за видами інфекції, що його викликає:
інфекційний;
вірусний;
грибковий;
паразитарний;
лікарський;
аутоімунний (гігантоклітинний міокардит).

По тривалості міокардит буває:
гострий;
хронічний.

По причині:
первинний (запалення розпочалося з міокарда);
вторинний (як наслідок інших хвороб).

Причини до 50% міокардитів залишаються нез'ясованими. Пояснити це можна величезною кількістю факторів, які призводять до цієї хвороби. Серед них є зовнішні та внутрішні.

Віруси: ентеровіруси, віруси Коксакі В, аденовірус, вірус грипу, цитомегаловірус, вірус поліомієліту, Епштейна — Барр, ВІЛ-1, вірус гепатиту, вітрянка, арбовіруси, респіраторно-синцитіальний вірус, герпес-вірус, герпес-вірус вірус сказу, парвовіруси та ін.
Ріккетсії: висипний тиф, лихоманка Q, лихоманка скелястих гір та ін.
Бактерії: дифтерійна та туберкульозна паличка, стрептококи, стафілококи, менінгококи, клостридії, бруцели, мікоплазми та ін.
Спірохети: боррелії, хвороба Лайма, сифіліс, лептоспіроз та ін.
Грибки: кандиди, аспергілл, криптококоз, гістоплазмоз, актиномікоз, бластомікоз.
Найпростіші: хвороба Шагаса, токсоплазмоз, трипаносомоз, малярія, лейшманіоз, балантидіаз.
Гельмінти: трихіноз, ехінококоз, шистосомоз, цистицеркоз, філяріоз та ін.
Укуси тварин: отрута скорпіона, зміїна отрута, укуси ос, отруйних павуків, кліщів.
Медикаменти: антибіотики (пеніцилін, хлорамфенікол, сульфаніламіди), метилдопа, спіронолактон, протисудомні препарати для хіміотерапії.
Наркотики: кокаїн, амфетаміни, похідні катехоламінів.
Хімічні речовини: алкоголь, окис вуглецю, миш'як, свинець, фосфор, ртуть, кобальт та ін.
Фізичні причини: переохолодження, перегрівання, радіація.
Гостра ревматична гарячка.
Системні запальні хвороби: гігантоклітинний міокардит, саркоїдоз, хвороба Крона, червоний вовчак, виразковий коліт, гранулематоз Вегенера, тиреотоксикоз, склеродерма, ревматоїдний артрит.
Післяродова кардіоміопатія.
Реакція відторгнення трансплантату.
''')

custom_disease_32 = Disease(symptoms=['Прискорене серцебиття', 'Повільне серцебиття' ,'Біль у грудній клітці', 'Задишка', 'Запаморочення', 'Слабкість', 'Втрата свідомості'], name="Порушення ритму серця", type="Серцево-судинна система та кров", info=
'''
Порушення ритму серця (аритмія) - це патологічний стан, при якому порушується частота, ритмічність та провідність імпульсу в серці. Серце б'ється надто швидко (тахікардія), надто повільно (брадикардія) чи нерегулярно.

Деякі види аритмій можуть бути відносно нешкідливими, тоді як інші становлять небезпеку для життя.

Захворювання також відоме як:
аритмія;
екстрасистолія;
тахікардія;
брадикардія.

Вроджені аномалії, структурні зміни провідної системи серця;
спадкові дефекти іонних каналів (структури мембран м'язових клітин);
ушкодження серцевого м'яза протягом життя (наслідки запалень серця, інфарктів та хвороб клапанів).
''')

custom_disease_33 = Disease(symptoms=['Страх', 'Тривога', 'Підвищений тиск', 'Суха шкіра', 'Бліда шкіра', 'Розширені зіниці', 'Озноб', 'Головний біль', 'Біль у серці'], name="Нейроциркуляторна дистонія", type="Серцево-судинна система та кров", info=
'''
Нейроциркуляторна дистонія (НЦД) - комплекс симптомів невротичного характеру, що виявляється страхом, прискореним серцебиттям та іншими скаргами без об'єктивних ознак ураження внутрішніх органів. Діагноз "НЦД" використовується тільки в Росії та СНД, у міжнародній класифікації хвороб він відноситься до групи психогенних.

Захворювання також відоме як:
вегето-судинна дистонія;
соматоформна дисфункція вегетативної нервової системи;
вегетативний невроз;
нейроциркуляторна астенія;
невроз серця;
гастроневроз.

Причины симптомов, объединяемых под названием НЦД, разнообразны. Во-первых, это нервное перенапряжение и стресс, которые часто могут вызывать жалобы со стороны сердца — учащенное сердцебиение, нехватку воздуха, аритмию, — а также повышенную тревожность и панические атаки. НЦД может впервые появиться после черепно-мозговой травмы.

Истинной причиной НЦД по гипертоническому типу может быть начинающаяся артериальная гипертензия. НЦД также может быть следствием эндокринных болезней, перенесенной инфекции и многих других состояний.


''')

custom_disease_34 = Disease(symptoms=['Наростання периферичних набряків', 'Слабкість', 'Головний біль', 'Запаморочення', 'Нудота', 'Зниження апетиту', 'Спрага', 'Задишка', 'Біль у грудній клітці', 'Судоми', 'Порушення свідомості'], name="Гостра ниркова недостатність", type="Серцево-судинна система та кров", info=
'''
Острая почечная недостаточность — это синдром, для которого характерно внезапное и быстрое нарушение функции почек.
С 2004 года введен термин острое почечное повреждение (ОПП) вместо острой почечной недостаточности (ОПН). С этого времени ОПН является лишь одной из стадий ОПП.
В основе острого повреждения почек лежит снижение скорости клубочковой фильтрации, которое приводит к накоплению в крови продуктов метаболизма и нарушению баланса электролитов, изменению pH крови и накоплению жидкости в организме.
Острая почечная недостаточность — это терминальная стадия острого повреждения почек, при которой больному требуется гемодиализ.

Про механизму развития различают три вида ОПП:
преренальное;
ренальное;
постренальное.


''')

custom_disease_35 = Disease(symptoms=['Головний біль', 'Запаморочення', 'Порушення свідомості', 'Втрата орієнтування у часі', 'Втрата орієнтування у просторі', 'Психомоторне збудження', 'Нудота', 'Прискоренне серцебиття', 'Сухість в роті', 'Потовиділення', 'Підвищена температура'], name="Гостре порушення мозкового кровообігу", type="Серцево-судинна система та кров", info=
'''
Гостро порушення мозкового кровообігу (ОНМК) - гостре захворювання, що виникає через різке порушення кровотоку в судинах головного мозку. До ОНМК відносять інсульти (ішемічний та геморагічний) та минущі порушення мозкового кровообігу (транзиторна ішемічна атака, гіпертонічний церебральний криз).

Захворювання також відоме як:
ВНМК;
інсульт;
геморагічний інсульт;
ішемічний інсульт;
транзиторна ішемічна атака;
минуще порушення мозкового кровообігу;
кардіоемболічний інсульт;
атеротромбічний інсульт;
гемодинамічний інсульт;
невеликий інсульт.

Причина ишемического инсульта — развитие локальной ишемии ткани головного мозга из-за закупорки артерии. Чаще всего закупорка происходит на фоне распространенного атеросклероза, когда атеросклеротическая бляшка закрывает просвет сосуда, делая невозможным адекватное питание головного мозга (атеротромбический ишемический инсульт).

Ишемия может возникать и вследствие тромбоэмболии артериального русла. В большинстве случаев тромб находится в камерах сердца и с током крови попадает в головной мозг, приводя к обструкции (кардиоэмболический инсульт). Такие тромбы часто встречаются при мерцательной аритмии, стенозах митрального клапана, инфекционном эндокардите и других патологиях.

В более редких случаях к ишемическому инсульту может приводить резкое падение артериального давления, что вызывает снижение церебрального кровотока и недостаточное кровообращение тканей мозга (гемодинамический инсульт). Причинами резкого падения АД может быть передозировка гипотензивных препаратов, ортостатическая гипотензия, инфаркт миокарда и др. Гемодинамический инсульт чаще возникает в сочетании с выраженным атеросклерозом.

Повышение артериального давления — основная причина развития геморрагического инсульта. Длительная артериальная гипертензия способствует повреждению и истончению сосудистой стенки. При высоких значениях АД возможен разрыв сосуда и формирование внутричерепной гематомы. Риск повышается при наличии ангиопатии (аневризм, сосудистые мальформации). Существуют и более редкие причины развития геморрагического инсульта: коагулопатии, фибромускулярная дисплазия соединительной ткани, васкулиты и т.д.

Транзиторная ишемическая атака развивается при обратимой обструкции артериального сосуда. При этом происходит самостоятельное восстановление перфузии нервной ткани и полный регресс неврологической симптоматики (малый инсульт).

Церебральный гипертонический криз также относится к ОНМК. Гемодинамические нарушения возникают при кризовом повышении артериального давления. Это вызвано длительным и злокачественным течением гипертонической болезни и может провоцироваться различными факторами (отмена гипотензивной терапии, эмоциональный стресс, физическое перенапряжение и др.).


''')

custom_disease_36 = Disease(symptoms=['Підвищена температура', 'Біль у серці', 'Біль у суглобах', 'Задишка', 'Пришвидшене серцебиття'], name="Ревматична лихоманка з ураженням серця", type="Серцево-судинна система та кров", info=
'''
Ревматична лихоманка з ураженням серця - це ускладнення тонзиліту або фарингіту, викликане специфічною стрептококовою інфекцією і протікає у вигляді аутоімунного системного запального захворювання сполучної тканини з переважним ураженням серця.

Захворювання також відоме як:
гостра ревматична гарячка;
ревмокардит;
хронічна ревматична хвороба серця;
ревматизм.

Причина гострої ревматичної лихоманки - бета-гемолітичний стрептокок групи А, який провокує вироблення антитіл проти власних тканин організму через нездатність імунної системи точно розрізнити антиген мікроорганізму. Антитіла з'єднуються з клітинами тканин серця та провокують розвиток запалення та їх загибель.
''')

custom_disease_37 = Disease(symptoms=['Зміна кольору шкіри на пальцях', 'Біль у пальцях', 'Локальна ішемія', 'Набряк на пальцях', 'Виразка на пальцях', 'Холодні пальці рук', 'Оніміння', 'Поколювання'], name="Синдром Рейно", type="Серцево-судинна система та кров", info=
'''
Синдром Рейно - це оборотний спазм пальцевих (дигітальних) артерій у відповідь вплив низьких температур або емоційний стрес. Спазм може супроводжуватися болем, онімінням, поколюванням та іншими неприємними відчуттями у кінчиках пальців. Синдром Рейно поділяється на первинний (хвороба Рейно) та вторинний (прояв іншого захворювання).

Захворювання також відоме як:
хвороба Рейно;
синдром Рейно - Леріша;
первинний синдром Рейно;
ідіопатичний синдром Рейно;
вторинний синдром Рейно;
феномен Рейно.

Синдром Рейно - захворювання з безліччю причин, що розвивається внаслідок порушення гормональної, нервової або внутрішньосудинної регуляції процесів розширення (вазодилатації) та звуження (вазоконстрикції) судин. При синдромі Рейно також порушуються процеси утворення судинних регуляторів, таких як оксид азоту, тромбоксан, ангіотензин, серотонін та інші. Порушення концентрації цих медіаторів призводить до активного звуження судин у відповідь дію зовнішніх подразників (холод, емоційний стрес).
Також у процесах регуляції судинного тонусу велику роль грає кальцитонін-ген-пов'язаний пептид, порушення синтезу якого призводить до недостатнього розширення судин.
Причини вторинного синдрому Рейно - захворювання, що викликають структурні зміни стінки судин і впливають на механізми нервової та гуморальної регуляції судинного тонусу.
''')
#['Блювота', 'Біль у грудній клітці', 'Біль за грудиною', 'Токсикоз', 'Відчуття страху', 'Поширення болю в лівому плечі']
custom_disease_38 = Disease(symptoms=['Біль за грудиною', 'Поширення болю в лівому плечі', 'Стиснення в грудях', 'Утруднене дихання', 'Відчуття страху', 'Нудота','Блювота'], name="Стенокардія", type="Серцево-судинна система та кров", info=
'''
Стенокардія - це клінічний синдром, що проявляється болем, стисненням або дискомфортом в області серця на тлі тимчасового порушення кровообігу серцевого м'яза (міокарда).
Приступи стенокардії часто розвиваються при фізичному чи емоційному напрузі.

Захворювання також відоме як:
"Грудна жаба";
стенокардія напруги;
нестабільна стенокардія.

Дуже довгий час причиною стенокардії вважалася атеросклеротична хвороба серцевих (коронарних) артерій. Згодом спазм цих артерій був визнаний "допоміжним", функціональним механізмом тимчасового порушення кровообігу (ішемії) міокарда та стенокардії.
''')

custom_disease_39 = Disease(symptoms=['Задишка', 'Біль у грудній клітці', 'Кровохаркання', 'Пришвидшене серцебиття', 'Пришвидшення дихання', 'Волога шкіра', 'Синюшність шкірних покривів', 'Непритомність'], name="Тромбоемболія легеневої артерії", type="Серцево-судинна система та кров", info=
'''
Тромбоэмболия легочной артерии — закупорка тромбом или эмболом ствола или ветви легочной артерии. При этом увеличивается сосудистое сопротивление в сосудах легких с последующим нарушением работы сердца, приводящее в большинстве случаев к его остановке. Также выделяются специфические вещества, действие которых приводит к падению артериального давления и шоку. Если закупоривается ветвь легочной артерии небольшого размера, то это вызывает инфарктную пневмонию — воспаление в легочной ткани, развивающееся вследствие нарушения кровоснабжения.

Захворювання також відоме як:
Виділяють три основні варіанти:

інфарктна пневмонія;
гостре легеневе серце;
невмотивована задишка.
''')

custom_disease_40 = Disease(symptoms=['Тупий ниючий біль у нижніх кінцівках', 'Тяжкість у ногах', 'Втома', 'Відчуття поколювання', 'Судоми', 'Шкірний свербіж', 'Сухість шкіри гомілок'], name="Варикозне розширення вен нижніх кінцівок", type="Серцево-судинна система та кров", info=
'''
Варикозне розширення вен нижніх кінцівок - це застійне порушення кровотоку в поверхневих венах нижніх кінцівок, що призводить до їхнього розширення. Виникає через порушення роботи клапанного апарату вен, який у нормі перешкоджають зворотному току крові у цих судинах.

Захворювання також відоме як:
також використовується термін варикозу.

Єдиного погляду причин виникнення захворювання немає. Серед можливих причин називають:
спадкову схильність;
тривалі статичні навантаження (м'язи нижніх кінцівок при скороченні стискають вену, це ускладнює проходження крові нею);
вагітність (здавлювання збільшеною маткою судин порушує венозний відтік);
підвищення тиску в черевній порожнині (підняття тяжкості);
вроджена слабкість судинної стінки та клапанів вен.
''')



all_dis_name = set()
for obj in gc.get_objects():

    if isinstance(obj, Disease):
        all_dis_name.add(obj.name)


all_dis = set() #Адреси всіх екземплярів класу
for obj in gc.get_objects():

    if isinstance(obj, Disease):
        all_dis.add(obj)


all_symptoms = set()
for obj in gc.get_objects():

    if isinstance(obj, Disease):
        for symptom in obj.symptoms:
            all_symptoms.add(symptom)



